# IsTileGroupContainedObject

## Description
Determines if the specified object is a tile group-contained object.

```pascal
FUNCTION IsTileGroupContainedObject(objectHandle : HANDLE): BOOLEAN;
```

```python
def vs.IsTileGroupContainedObject(objectHandle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE|The object handle to check.|

## Examples
```pascal
return := IsTileGroupContainedObject(objectHandle);
```

```pascal
resultOK := IsTileGroupContainedObject(objectHandle);
```
```python
import vs

# Determines if the specified object is a tile group-contained object.
objectHandle = vs.FSActLayer()  # handle to the first selected object on the active layer

ok = vs.IsTileGroupContainedObject(objectHandle)
if ok:
    vs.Message('IsTileGroupContainedObject succeeded')
else:
    vs.Message('IsTileGroupContainedObject failed')
```

## See Also
VS Functions:
CreateTile
| ShowEditTileDialog
| ShowEditTileSettingsDialog
| ShowNewTileDialog
| GetTileGeometryGroup
| BeginGroupN
| AddTileGeometryObject
| GetTileGroupParent
| IsTileGroupContainedObject
| GetTileBackgroundColor
| SetTileBackgroundColor
| GetTileRepetitionPoint
| SetTileRepetitionPoint
| GetTileOffsetPoint
| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011

## Category
* Document Attributes